# NoVisibleTargetsForCurrentConstraint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..NoVisibleTargetsForCurrentConstraint Property
BuiltInFailures..::..RebarFailures Class See Also
---
There are no visible constraint targets in the current view. Please switch to another view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoVisibleTargetsForCurrentConstraint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoVisibleTargetsForCurrentConstraint As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoVisibleTargetsForCurrentConstraint {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace